# SkylightFailures Properties

---
The BuiltInFailuresSkylightFailures type exposes the following members.
| Name| Description
---|---|---
| MinSkylightWidthImperial|  The minimum skylight width is 8 inches.
| MinSkylightWidthMetric|  The minimum skylight width is 203.2 millimeters.
Top
#### Reference
BuiltInFailuresSkylightFailures Class
Autodesk.Revit.DB Namespace